performance/tests/stockEvent.yml
execution:
  - concurrency: 1
    hold-for: 2m
    scenario: send-stock-event

scenarios:
  get-user-token:
    requests:
    - if: '${__javaScript(vars.get("access_token") == null)}'
      then:
        - url: ${__P(base-uri)}/api/oauth/token
          method: POST
          label: GetUserToken
          headers:
            Authorization: Basic ${__base64Encode(${__P(user-auth)})}
          body:
            grant_type: password
            username: ${__P(username)}
            password: ${__P(password)}
          extract-jsonpath:
            access_token:
              jsonpath: $.access_token
  get-facility-type:
    requests:
    - if: '${__javaScript(vars.get("facility_type_id") == null)}'
      then:
        - url: ${__P(base-uri)}/api/facilities/${facility_id}
          method: GET
          label: GetFacilityType
          headers:
            Authorization: Bearer ${access_token}
            Content-Type: application/json
          extract-jsonpath:
            facility_type_id:
              jsonpath: $.type.id
          jsr223:
            script-text: |
              def uuid = vars.get("facility_type_id");
              uuid = uuid.replaceAll(/"|\[|\]/, "");
              vars.put("facility_type_id", uuid);
  get-full-supply-approved-products:
    requests:
    - if: '${__javaScript(vars.get("full_products") == null)}'
      then:
        - url: ${__P(base-uri)}/api/facilities/${facility_id}/approvedProducts?programId=${program_id}&fullSupply=true
          method: GET
          label: GetFullSupplyApprovedProducts
          headers:
            Authorization: Bearer ${access_token}
            Content-Type: application/json
          extract-jsonpath:
            full_products:
              jsonpath: $..orderable
  get-two-reasons:
    requests:
    - if: '${__javaScript(vars.get("consumed_reason") == null)} && ${__javaScript(vars.get("receipts_reason") == null)}'
      then:
        - url: ${__P(base-uri)}/api/validReasons?program=${program_id}&facilityType=${facility_type_id}
          method: GET
          label: GetTwoReasons
          headers:
            Authorization: Bearer ${access_token}
            Content-Type: application/json
          extract-jsonpath:
            consumed_reason:
              jsonpath: $..reason[?(@.id == "b5c27da7-bdda-4790-925a-9484c5dfb594")]
            receipts_reason:
              jsonpath: $..reason[?(@.id == "313f2f5f-0c22-4626-8c49-3554ef763de3")]
          jsr223:
            script-text: |
              def map = [
                consumed: vars.get("consumed_reason"),
                receipts: vars.get("receipts_reason")
              ]

              vars.put("consumed_reason", map.consumed.replaceAll(/\[|\]/, ""))
              vars.put("receipts_reason", map.receipts.replaceAll(/\[|\]/, ""))
  send-stock-event:
    variables:
      # Balaka District Hospital
      facility_id: 13037147-1769-4735-90a7-b9b310d128b8
      # Essential Meds
      program_id: 10845cb9-d365-4aaa-badd-b4fa39c6a26a
      # Administrator
      user_id: a337ec45-31a0-4f2b-9b2e-a105c4b669bb
    requests:
      - include-scenario: get-user-token
      - include-scenario: get-facility-type
      - include-scenario: get-full-supply-approved-products
      - include-scenario: get-two-reasons
      - url: ${__P(base-uri)}/api/stockEvents
        method: POST
        label: SendStockEvent
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
        jsr223:
          execute: before
          script-text: |
            import groovy.json.JsonOutput
            import groovy.json.JsonSlurper

            def parser = new JsonSlurper()
            def consumed = parser.parseText(vars.get("consumed_reason"))
            def receipts = parser.parseText(vars.get("receipts_reason"))

            def products = parser.parseText(vars.get("full_products"))
            products = products.sort { it.id }

            def eventLineItems = new ArrayList()

            products.eachWithIndex { it, index ->
              eventLineItems.add([
                orderableId: it.id,
                quantity: (index + 1) * 10,
                occurredDate: new Date().format('yyyy-MM-dd'),
                stockAdjustments: [
                  [quantity: (index + 1) * 5, reason: receipts],
                  [quantity: (index + 1) * 5, reason: consumed]
                ]
              ])
            }

            def stockEvent = [
              facilityId: vars.get("facility_id"),
              programId: vars.get("program_id"),
              userId: vars.get("user_id"),
              lineItems: eventLineItems
            ]

            vars.put("stock_event", JsonOutput.toJson(stockEvent))
        body: ${stock_event}

reporting:
    - module: passfail
      criteria:
        Send stock event too slow: p90 of SendStockEvent>500ms